In [285]:
import numpy as np
import pandas as pd

In [286]:
"""               Combining Datasets: Merge and Join                  """

'               Combining Datasets: Merge and Join                  '

In [287]:
# >>>--------------------> Relational Algebra <---------------------<<< #
# >>>--------------------> Categories of Joins <--------------------<<< #

In [288]:
#One-to-one joins >> -- >

In [289]:
df1 = pd.DataFrame({
    "employee":["Bob", "Jake", "Lisa", "Sue"],
    "group" :["Accounting", "Engineering", "Engineering", "HR"]
})

df2 = pd.DataFrame({
    "employee": ["Lisa", "Bob", "Jake", "Sue"],
    "hire_date": [2004, 2008, 2012, 2014]
})

print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [290]:
df3 = pd.merge(df1, df2)
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [291]:
# Many-to-one joins

In [292]:
df4 = pd.DataFrame({
    "group": ["Accouting", "Engineering", "HR"],
    "supervisor":["Carly", "Guido", "Steve"]
})

print(f"\ndf3:\n{df3}")
print(f"\ndf4:\n{df4}")
print(f"\npd.merge(df3, df4):\n{pd.merge(df3, df4)}")

df3:
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4:
         group supervisor
0    Accouting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4):
  employee        group  hire_date supervisor
0     Jake  Engineering       2012      Guido
1     Lisa  Engineering       2004      Guido
2      Sue           HR       2014      Steve

In [293]:
# Many-to-many joins

In [294]:
df5 = pd.DataFrame({
    'group': ['Accounting', 'Accounting',
              'Engineering', 'Engineering', 'HR', 'HR'],
    'skills': ['math', 'spreadsheets', 'coding', 'linux',
               'spreadsheets', 'organization']
})

print(df1)
print(df5)
print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [295]:
"""                  Specification of the Merge Key                   """

'                  Specification of the Merge Key                   '

In [296]:
# The on keyword

In [297]:
print(df1)
print(df2)
print(pd.merge(df1, df2, on= "employee"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [298]:
# The left_on and right_on keywords

In [299]:
df3 = pd.DataFrame({
    "name":["Bob", "Jake", "Lisa", "Sue"],
    "salary": [70000, 80000, 120000, 90000]
})

print(df1)
print(df3)
print(pd.merge(df1, df3, left_on= "employee", right_on= "name" ))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [300]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [301]:
# The left_index and right_index keywords

In [302]:
df1a = df1.set_index("employee")
df2a = df2.set_index("employee")
print(df1a)
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [303]:
pd.merge(df1a, df2a, left_index= True, right_index= True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [304]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [305]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [306]:
"""                Specifying Set Arithmetic for Joins                """

'                Specifying Set Arithmetic for Joins                '

In [307]:
df6 = pd.DataFrame({
    "name": ["Peter", "Paul", "Mary"],
    "food": ["fish", "beans", "bread"]
}, columns= ["name", "food"])

df7 = pd.DataFrame({
    "name" : ["Mary", "Joseph"],
    "drink": ["wine", "beer"]
}, columns= ["name", "drink"])

print(df6)
print(df7)
print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [308]:
pd.merge(df6, df7, how = "inner")

   name   food drink
0  Mary  bread  wine

In [309]:
pd.merge(df6, df7, how = "outer")

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [310]:
pd.merge(df6, df7, how = "left")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [311]:
pd.merge(df6, df7, how = "right")

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [312]:
pd.merge(df6, df7, how ="cross")

  name_x   food  name_y drink
0  Peter   fish    Mary  wine
1  Peter   fish  Joseph  beer
2   Paul  beans    Mary  wine
3   Paul  beans  Joseph  beer
4   Mary  bread    Mary  wine
5   Mary  bread  Joseph  beer

In [313]:
"""           Overlapping Column Names: The suffixes Keyword          """

'           Overlapping Column Names: The suffixes Keyword          '

In [314]:
df8 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [1, 2, 3, 4]
})

df9 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [3, 1, 4, 2]
})

print(df8)
print(df9)
print(pd.merge(df8, df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [315]:
print(pd.merge(df8, df9, on = "name", suffixes= ["_L", "_R"]))

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [316]:
"""                    Example: US States Data                        """

'                    Example: US States Data                        '

In [317]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
print(pop.head())
print(areas.head())
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [318]:
merged = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [319]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [320]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

In [321]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [322]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [323]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [324]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [325]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [326]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [327]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
43            AK  total  2010    713868.0      Alaska       656425.0
51            AL  total  2010   4785570.0     Alabama        52423.0
141           AR  total  2010   2922280.0    Arkansas        53182.0
149           AZ  total  2010   6408790.0     Arizona       114006.0
197           CA  total  2010  37333601.0  California       163707.0

In [328]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [329]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [330]:
"""                       Example (1 - 10)                            """

'                       Example (1 - 10)                            '

In [331]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "inner")

   id        name                score
0   1  Kamoliddin    AI ML engineering
1   2    Diyorbek        Pathon Bakend
2   3     Azizbek       Ai engineering
3   4   Sardorbek                Atlet
4   5       Izmir              Surgeon
5   6        Alya          Eye surgeon
6   7      Zubayr                   ML
7   8   Zakariyya                   DL
8   9      Mikoil      Quran Memorizer
9  10      Fotima  Surgeon Eye ancolog

In [332]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "left")

    id        name                score
0    1  Kamoliddin    AI ML engineering
1    2    Diyorbek        Pathon Bakend
2    3     Azizbek       Ai engineering
3    4   Sardorbek                Atlet
4    5       Izmir              Surgeon
5    6        Alya          Eye surgeon
6    7      Zubayr                   ML
7    8   Zakariyya                   DL
8    9      Mikoil      Quran Memorizer
9   10      Fotima  Surgeon Eye ancolog
10  11       Zuhra                  NaN
11  12       Hasan                  NaN
12  13       Husan                  NaN

In [333]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})
print(pd.merge(students, scores, how = "outer").isnull().sum())
pd.merge(students, scores, how = "outer")

id       0
name     0
score    3
dtype: int64

    id        name                score
0    1  Kamoliddin    AI ML engineering
1    2    Diyorbek        Pathon Bakend
2    3     Azizbek       Ai engineering
3    4   Sardorbek                Atlet
4    5       Izmir              Surgeon
5    6        Alya          Eye surgeon
6    7      Zubayr                   ML
7    8   Zakariyya                   DL
8    9      Mikoil      Quran Memorizer
9   10      Fotima  Surgeon Eye ancolog
10  11       Zuhra                  NaN
11  12       Hasan                  NaN
12  13       Husan                  NaN

In [335]:
df1a = pd.DataFrame({
    "student_id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "age":[20, 21, 22, 19, 18, 22, 17, 16, 12, 20, 12, 23, 20]

})

df2a = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "grade":[4.3, 5, 3.23, 4.56, 5, 4.05, 5, 2.78, 3.45, 4.1, 4.5, 5, 3.9]
})

pd.merge(df1a, df2a, left_on= "student_id", right_on = "id")

    student_id  age  id  grade
0            1   20   1   4.30
1            2   21   2   5.00
2            3   22   3   3.23
3            4   19   4   4.56
4            5   18   5   5.00
5            6   22   6   4.05
6            7   17   7   5.00
7            8   16   8   2.78
8            9   12   9   3.45
9           10   20  10   4.10
10          11   12  11   4.50
11          12   23  12   5.00
12          13   20  13   3.90

In [338]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]
})

pd.merge(students, scores, left_index= True, right_index=True)

   id_x        name  id_y                score
0     1  Kamoliddin     1    AI ML engineering
1     2    Diyorbek     2        Pathon Bakend
2     3     Azizbek     3       Ai engineering
3     4   Sardorbek     4                Atlet
4     5       Izmir     5              Surgeon
5     6        Alya     6          Eye surgeon
6     7      Zubayr     7                   ML
7     8   Zakariyya     8                   DL
8     9      Mikoil     9      Quran Memorizer
9    10      Fotima    10  Surgeon Eye ancolog

In [340]:
orders = pd.DataFrame({
    "order_id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    "product":["Winter jacket", "Puffer coat", "Hooded parka", "Wool sweater",
                "Knit cardigan", "Thermal long-sleeve shirt", "Fleece hoodie",
                "Sweatshirt", "Thermal pants", "Winter jeans", "Snow pants",
                "Scarf", "Beanie hat", "Gloves/Mittens", "Warm socks"]
})

prices = pd.DataFrame({
    "product":["Winter jacket", "Puffer coat", "Hooded parka", "Down vest",
                "Wool sweater", "Fleece hoodie", "Thermal long-sleeve shirt",
                "Sweatshirt", "Turtleneck sweater", "Thermal pants",
                "Snow pants", "Winter jeans", "Scarf",
                "Beanie hat", "Gloves/Mittens"],

    "price $":[60, 70, 65, 50, 40, 35, 25, 30, 
             45, 30, 50, 40, 15, 12, 10]

})

pd.merge(orders, prices)

    order_id                    product  price $
0          1              Winter jacket       60
1          2                Puffer coat       70
2          3               Hooded parka       65
3          4               Wool sweater       40
4          6  Thermal long-sleeve shirt       25
5          7              Fleece hoodie       35
6          8                 Sweatshirt       30
7          9              Thermal pants       30
8         10               Winter jeans       40
9         11                 Snow pants       50
10        12                      Scarf       15
11        13                 Beanie hat       12
12        14             Gloves/Mittens       10

In [346]:
students = pd.DataFrame({
    "name": ["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
             "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
             "Zuhra", "Hasan", "Husan"],

    "score": ["AI ML engineering", "Pathon Bakend", "Ai engineering",
              "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
              "Quran Memorizer", "Surgeon Eye ancolog", "Student 11", 
              "Student 12", "Student 13"]
})

scores = pd.DataFrame({
    "name": ["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
             "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
             "Zuhra", "Hasan", "Husan"],

    "score": ["AI ML engineering", "Pathon Bakend", "Ai engineering",
              "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
              "Quran Memorizer", "Surgeon Eye ancolog", "Score 11", 
              "Score 12", "Score 13"]
})

pd.merge(students, scores, on="name", suffixes=('_students', '_scores'))

          name       score_students         score_scores
0   Kamoliddin    AI ML engineering    AI ML engineering
1     Diyorbek        Pathon Bakend        Pathon Bakend
2      Azizbek       Ai engineering       Ai engineering
3    Sardorbek                Atlet                Atlet
4        Izmir              Surgeon              Surgeon
5         Alya          Eye surgeon          Eye surgeon
6       Zubayr                   ML                   ML
7    Zakariyya                   DL                   DL
8       Mikoil      Quran Memorizer      Quran Memorizer
9       Fotima  Surgeon Eye ancolog  Surgeon Eye ancolog
10       Zuhra           Student 11             Score 11
11       Hasan           Student 12             Score 12
12       Husan           Student 13             Score 13

In [347]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "inner")

   id        name                score
0   1  Kamoliddin    AI ML engineering
1   2    Diyorbek        Pathon Bakend
2   3     Azizbek       Ai engineering
3   4   Sardorbek                Atlet
4   5       Izmir              Surgeon
5   6        Alya          Eye surgeon
6   7      Zubayr                   ML
7   8   Zakariyya                   DL
8   9      Mikoil      Quran Memorizer
9  10      Fotima  Surgeon Eye ancolog

In [349]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "left")

    id        name                score
0    1  Kamoliddin    AI ML engineering
1    2    Diyorbek        Pathon Bakend
2    3     Azizbek       Ai engineering
3    4   Sardorbek                Atlet
4    5       Izmir              Surgeon
5    6        Alya          Eye surgeon
6    7      Zubayr                   ML
7    8   Zakariyya                   DL
8    9      Mikoil      Quran Memorizer
9   10      Fotima  Surgeon Eye ancolog
10  11       Zuhra                  NaN
11  12       Hasan                  NaN
12  13       Husan                  NaN

In [350]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "right")

   id        name                score
0   1  Kamoliddin    AI ML engineering
1   2    Diyorbek        Pathon Bakend
2   3     Azizbek       Ai engineering
3   4   Sardorbek                Atlet
4   5       Izmir              Surgeon
5   6        Alya          Eye surgeon
6   7      Zubayr                   ML
7   8   Zakariyya                   DL
8   9      Mikoil      Quran Memorizer
9  10      Fotima  Surgeon Eye ancolog

In [352]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "outer")

    id        name                score
0    1  Kamoliddin    AI ML engineering
1    2    Diyorbek        Pathon Bakend
2    3     Azizbek       Ai engineering
3    4   Sardorbek                Atlet
4    5       Izmir              Surgeon
5    6        Alya          Eye surgeon
6    7      Zubayr                   ML
7    8   Zakariyya                   DL
8    9      Mikoil      Quran Memorizer
9   10      Fotima  Surgeon Eye ancolog
10  11       Zuhra                  NaN
11  12       Hasan                  NaN
12  13       Husan                  NaN

In [356]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores).sort_values(by = "name", ascending= False)

   id        name                score
6   7      Zubayr                   ML
7   8   Zakariyya                   DL
3   4   Sardorbek                Atlet
8   9      Mikoil      Quran Memorizer
0   1  Kamoliddin    AI ML engineering
4   5       Izmir              Surgeon
9  10      Fotima  Surgeon Eye ancolog
1   2    Diyorbek        Pathon Bakend
2   3     Azizbek       Ai engineering
5   6        Alya          Eye surgeon

In [358]:
students = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    "name":["Kamoliddin", "Diyorbek", "Azizbek", "Sardorbek",
            "Izmir", "Alya", "Zubayr", "Zakariyya", "Mikoil", "Fotima", 
            "Zuhra", "Hasan", "Husan"]
})

scores = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "score":["AI ML engineering", "Pathon Bakend", "Ai engineering",
             "Atlet", "Surgeon", "Eye surgeon", "ML", "DL", 
             "Quran Memorizer", "Surgeon Eye ancolog" ]


})

pd.merge(students, scores, how = "right").isnull().any()

id       False
name     False
score    False
dtype: bool